app/views/user_books/_form.html.erb

SELECT "users".* FROM "users" ORDER BY "users"."username" ASC
---
    <%= form.label :user_id, "Select User" %>
    <%= form.select :user_id, User.order(:username).map { |user| [user.username, user.id] }, include_blank: "Please Select a User", id: "id_of_the_user_id_select_box" %>

SELECT "books".* FROM "books" ORDER BY "books"."title" ASC
---
    <%= form.label :book_id, "Select Book" %>
    <%= form.select :book_id, Book.order(:title).map { |book| [book.title, book.id] }, include_blank: "Please Select a Book", id: "id_of_the_book_id_select_box" %>